---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBackDirn1
source: html/ff3b9be3-836a-84a4-4be9-f098522ff249.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveBackDirn1 Property

"Interior Major Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveBackDirn1 { get; }
```